---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.ByType
enum: Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption
source: html/bf5d6c5a-02db-6fba-973d-df9a5f3bc5d7.htm
---
# Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.ByType

The rails will be joined according to the settings in the rail type.